#include <stdlib.h>
#include <stdio.h>

void clearInput(void);

int main(void) {
    printf("\033[?25l");
    
    while (1) {
        // система-10
        int _10 = 0; 
        
        // система-2
        short *_2 = (short int *)calloc(8, sizeof(short));
        if (NULL == _2) { return 1; }
        
        // система-16
        
        int *number = (int *)malloc(sizeof(int) * 1);
        if (NULL == number) { return 1; } *number = 0;
        
        while (1) {
            printf("Исходное значение (0-255): ");
            if (scanf("%d", number) == 1) {
                if (*number > -1 && *number < 256) { break; }
            }
            clearInput();
        }
        
        for (int i = 0; i < *number; i++) {
            if (_2[1] == 1 && _2[2] == 1 && _2[3] == 1 && _2[4] == 1 && _2[5] == 1 && _2[6] == 1 && _2[7] == 1) {
                _2[0]++;
                _2[1]--;
                _2[2]--;
                _2[3]--;
                _2[4]--;
                _2[5]--;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[2] == 1 && _2[3] == 1 && _2[4] == 1 && _2[5] == 1 && _2[6] == 1 && _2[7] == 1) {
                _2[1]++;
                _2[2]--;
                _2[3]--;
                _2[4]--;
                _2[5]--;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[3] == 1 && _2[4] == 1 && _2[5] == 1 && _2[6] == 1 && _2[7] == 1) {
                _2[2]++;
                _2[3]--;
                _2[4]--;
                _2[5]--;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[4] == 1 && _2[5] == 1 && _2[6] == 1 && _2[7] == 1) {
                _2[3]++;
                _2[4]--;
                _2[5]--;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[5] == 1 && _2[6] == 1 && _2[7] == 1) {
                _2[4]++;
                _2[5]--;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[6] == 1 && _2[7] == 1) {
                _2[5]++;
                _2[6]--;
                _2[7]--;
            }
            
            if (_2[7] == 1) {
                _2[6]++;
                _2[7]--;
            }
            
            _2[7]++;
            
        }
        
        for (int i = 0; i < 8; i++) {
            printf("%hd ", _2[i]);
        }
        
        getchar(); getchar();        system("clear");
        free(number); free(_2);
    }
    
    printf("Программа завершилась...");
    return 0;
}


void clearInput(void) {
    int c; while ((c = getchar()) != '\n' && c != EOF);
}